ХМНПФ_Общее/Documents/уп_РешениеОЕдиновременнойВыплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РешениеОЕдиновременнойВыплате</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЕдиновременнойВыплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаНаСчете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяВыплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоначислениеПоПереданномуВзносуИзПФР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_РазмерГП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_СрокПП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ДатаГосПенсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ДатаСозданияДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеУчитыватьДопВзносы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаСуммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорОПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипСуммы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипРезерва</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаГарантированная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаКомпенсации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВосполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВозмещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ХМ_ДатаВыплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_РезервыОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РезервыОПС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВосполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Движение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДвиженияЕПС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.епс_ВидыДвиженияПенсионныхНакоплений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостояниеЧастиПенсионногоСчетаОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_РасшифровкаСостоянияДоговораОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостояниеЧастиПенсионногоСчетаОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_РасшифровкаСостоянияДоговораОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПричиныЗакрытияДоговоровОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПричиныЗакрытияДоговоровОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ПричиныЗакрытияДоговораОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_РешениеОЕдиновременнойВыплате/Ext/ObjectModule.bsl
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 14.12.2015 ЛыткинАМ // ПечатьРешенияОВыплате() // №84
	// ХМНПФ 14.12.2015 ЛыткинАМ // ПечатьРешенияОДопВыплате() // №84
	// ХМНПФ 04.04.2016 ШадринАВ // ПроверкаКорректности() // №299
	// ХМНПФ 28.07.2016 ШадринАВ // ПроверитьОстатки() // №447
	// ХМНПФ 10.09.2016 ЛыткинАМ // ПроверкаКорректности
	// ХМНПФ 28.02.2017 ШадринАВ // ПечатьРешенияОВыплате() // №830
	// ХМНПФ 28.02.2017 ШадринАВ // ПечатьРешенияОВыплатеСервер() // №830
	// ХМНПФ 28.02.2017 ШадринАВ // ПечатьРешенияОДопВыплатеСервер() // №830	
	// ХМНПФ 17.08.2017 ШадринАВ // В макет РешениеОДопВыплате2015 добавлены печати и подписи // №1131
	// ХМНПФ 17.08.2017 ШадринАВ // ПечатьРешенияОДопВыплате() // №1131
	// ХМНПФ 17.08.2017 ШадринАВ // ПечатьРешенияОДопВыплатеСервер() // №1131
	// ХМНПФ 19.02.17 Кучеров // Новая Функция ХМ_ПечатьWeb()
	// ХМНПФ 19.02.17 Кучеров //Модуль //убрал директиву на клиенте т.к. процедуры (функции) получения печатных форм должны выполняться и на сервере
	// ХМНПФ 07.09.2017 ШадринАВ // ПроверитьДатыПредыдущихРешений() // №1147
КонецПроцедуры

// +ХМНПФ 28.02.2017 ШадринАВ // ПечатьРешенияОВыплате() // №830
//Функция ПечатьРешенияОВыплате()
Функция ПечатьРешенияОВыплате(ХМ_ПечататьРасчет = Истина)
	//#Вставка
// -ХМНПФ 28.02.2017 ШадринАВ // ПечатьРешенияОВыплате() // №830
	//#КонецВставки

	ТабДок = Новый ТабличныйДокумент;
	Если Дата < Дата("20150101") Тогда
		Макет = Документы.уп_РешениеОЕдиновременнойВыплате.ПолучитьМакет("РешениеОВыплате");
	Иначе
		Макет = Документы.уп_РешениеОЕдиновременнойВыплате.ПолучитьМакет("РешениеОВыплате2015");
	КонецЕсли;
	// Заголовок

	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация, Дата);
	ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");

	
	Область = Макет.ПолучитьОбласть("Решение");
	Область.Параметры.Число = Формат(Дата, "ДФ=дд");
	Область.Параметры.Месяц = Сред(Формат(Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(Дата, "ДЛФ=дд")))-10);
	Область.Параметры.Год = Формат(Дата, "ДФ=гггг");
	Область.Параметры.НаименованиеФонда = ПредставлениеОрганизации;
	Область.Параметры.НомерРешения = Номер;
	
	ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", ДоговорОПС.Участник.уп_ФизЛицо));
	Фамилия = ФИОФизЛица.Фамилия;
	Имя = ФИОФизЛица.Имя;                
	Отчество = ФИОФизЛица.Отчество;
	//Область.Параметры.ФИОНомерСчета = Фамилия+" "+Имя+" "+Отчество+", "+уп_ОПС.ПреобразоватьНомерПФР(ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР);
	Область.Параметры.ФИО = Фамилия+" "+Имя+" "+Отчество;
	Область.Параметры.НомерСчета = ДоговорОПС.НомерЛицевогоСчета;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ВидДокументаОснования       = ДокументОснование.Метаданные().Имя;
		//#Удаление
		//Если ВидДокументаОснования = "уп_ЗаявлениеЗЛОНазначенииНЧТП" Тогда
		//	Область.Параметры.ДатаРегистрации = ДокументОснование.Дата;
		//Иначе
		//	Область.Параметры.ДатаРегистрации = ДокументОснование.ДатаРегистрации;
		//КонецЕсли
		//#КонецУдаления
		//#Вставка
		// +ХМНПФ 04.06.2021 ШадринАВ // ПечатьРешенияОВыплате() // №3244
		//Если ВидДокументаОснования = "уп_ЗаявлениеЗЛОНазначенииНЧТП" Тогда
		//	Область.Параметры.ДатаРегистрации = ДокументОснование.Дата;
		//Иначе
		//	Область.Параметры.ДатаРегистрации = ДокументОснование.ДатаРегистрации;
		//КонецЕсли;
		Область.Параметры.ДатаРегистрации = ДокументОснование.Дата;
		// -ХМНПФ 04.06.2021 ШадринАВ // ПечатьРешенияОВыплате() // №3244
		//#КонецВставки
		Область.Параметры.НомерЗаявления = СокрЛП(ДокументОснование.Номер);
	Конецесли;
	
	Если ТипЕдиновременнойВыплаты = 0 Тогда
		Область.Параметры.Подпункт = "а";
	Иначе
		Область.Параметры.Подпункт = "б";
	КонецЕсли;
	
	ВалютаПечати = Константы.ВалютаРегламентированногоУчета.Получить();
	ПараметрыПрописиНаРусском = ВалютаПечати.ПараметрыПрописи;
	ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "1", "0");
	ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "2", "0");
	ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "3", "0");
	Область.Параметры.Сумма=СуммаНаСчете; //ММВ Добавлена сумма числом (рядом с сумой прописью и отцентрировали)
	Область.Параметры.РублиПрописью = ЧислоПрописью(Цел(СуммаНаСчете), "L=ru_RU; НП=Ложь; НД=Ложь", ПараметрыПрописиНаРусском);
	Область.Параметры.Копейки      = Формат(Цел((СуммаНаСчете-Цел(СуммаНаСчете))*100), "ЧЦ=2; ЧН=00");
	
	СведенияОбОтветственном = уп_ПользовательскиеНастройкиСервер.ПолучитьСведенияОбУполномоченномЛице(Документы.уп_РешениеОЕдиновременнойВыплате.ПустаяСсылка(),Организация,ДоговорОПС.Филиал,Пользователи.ТекущийПользователь(),"Решение",Дата);
	Если ЗначениеЗаполнено(СведенияОбОтветственном.Фамилия) Тогда
		Область.Параметры.ДолжностьРуководителя = СведенияОбОтветственном.Должность;
		Область.Параметры.ФИОРуководителя = СведенияОбОтветственном.Фамилия+" "+Лев(СведенияОбОтветственном.Имя,1)+"."+" "+Лев(СведенияОбОтветственном.Отчество,1)+".";
	Иначе
		Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(Организация, Дата);
		Область.Параметры.ФИОРуководителя = Руководители.РуководительПредставление;
		Область.Параметры.ДолжностьРуководителя = Руководители.РуководительДолжность;
	КонецЕсли;	
	
	ТабДок.Вывести(Область); 
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	//ТабДок.Показать();
	//#Вставка
	// +ХМНПФ 14.12.2015 ЛыткинАМ // ПечатьРешенияОВыплате() // №84
	Если ХМ_ПечататьРасчет Тогда ХМ_ФункцииОтчетов.ПечатьРешения_ДобавитьРасчет(ЭтотОбъект,ТабДок) КонецЕсли;
	// -ХМНПФ 14.12.2015 ЛыткинАМ // ПечатьРешенияОВыплате() // №84
    Возврат ТабДок;
	//#КонецВставки

КонецФункции // ПечатьПриложения1()

// +ХМНПФ 28.02.2017 ШадринАВ // ПечатьРешенияОВыплатеСервер() // №830
//Функция ПечатьРешенияОВыплатеСервер(ТабДок) Экспорт
Функция ПечатьРешенияОВыплатеСервер(ТабДок, ХМ_ПечататьРасчет = Истина) Экспорт
// -ХМНПФ 28.02.2017 ШадринАВ // ПечатьРешенияОВыплатеСервер() // №830

	Если ТабДок=Неопределено Тогда
		ТабДок = Новый ТабличныйДокумент;
	Иначе
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	Если Дата < Дата("20150101") Тогда
		Макет = Документы.уп_РешениеОЕдиновременнойВыплате.ПолучитьМакет("РешениеОВыплате");
	Иначе
		Макет = Документы.уп_РешениеОЕдиновременнойВыплате.ПолучитьМакет("РешениеОВыплате2015");
	КонецЕсли;
	// Заголовок

	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация, Дата);
	ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");

	
	Область = Макет.ПолучитьОбласть("Решение");
	Область.Параметры.Число = Формат(Дата, "ДФ=дд");
	Область.Параметры.Месяц = Сред(Формат(Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(Дата, "ДЛФ=дд")))-10);
	Область.Параметры.Год = Формат(Дата, "ДФ=гггг");
	Область.Параметры.НаименованиеФонда = ПредставлениеОрганизации;
	Область.Параметры.НомерРешения = Номер;
	
	ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", ДоговорОПС.Участник.уп_ФизЛицо));
	Фамилия = ФИОФизЛица.Фамилия;
	Имя = ФИОФизЛица.Имя;                
	Отчество = ФИОФизЛица.Отчество;
	//Область.Параметры.ФИОНомерСчета = Фамилия+" "+Имя+" "+Отчество+", "+уп_ОПС.ПреобразоватьНомерПФР(ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР);
	Область.Параметры.ФИО = Фамилия+" "+Имя+" "+Отчество;
	Область.Параметры.НомерСчета = ДоговорОПС.НомерЛицевогоСчета;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ВидДокументаОснования       = ДокументОснование.Метаданные().Имя;
		//#Удаление
		//Если ВидДокументаОснования = "уп_ЗаявлениеЗЛОНазначенииНЧТП" Тогда
		//	Область.Параметры.ДатаРегистрации = ДокументОснование.Дата;
		//Иначе
		//	Область.Параметры.ДатаРегистрации = ДокументОснование.ДатаРегистрации;
		//КонецЕсли;
		//#КонецУдаления
		//#Вставка
		// +ХМНПФ 04.06.2021 ШадринАВ // ПечатьРешенияОВыплатеСервер() // №3244
		//Если ВидДокументаОснования = "уп_ЗаявлениеЗЛОНазначенииНЧТП" Тогда
		//	Область.Параметры.ДатаРегистрации = ДокументОснование.Дата;
		//Иначе
		//	Область.Параметры.ДатаРегистрации = ДокументОснование.ДатаРегистрации;
		//КонецЕсли;
		Область.Параметры.ДатаРегистрации = ДокументОснование.Дата;
		// -ХМНПФ 04.06.2021 ШадринАВ // ПечатьРешенияОВыплатеСервер() // №3244
		//#КонецВставки
		Область.Параметры.НомерЗаявления = СокрЛП(ДокументОснование.Номер);
	Конецесли;
	
	Если ТипЕдиновременнойВыплаты = 0 Тогда
		Область.Параметры.Подпункт = "а";
	Иначе
		Область.Параметры.Подпункт = "б";
	КонецЕсли;
	
	ВалютаПечати = Константы.ВалютаРегламентированногоУчета.Получить();
	ПараметрыПрописиНаРусском = ВалютаПечати.ПараметрыПрописи;
	ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "1", "0");
	ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "2", "0");
	ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "3", "0");
	Область.Параметры.Сумма=СуммаНаСчете; //ММВ Добавлена сумма числом (рядом с сумой прописью и отцентрировали)
	Область.Параметры.РублиПрописью = ЧислоПрописью(Цел(СуммаНаСчете), "L=ru_RU; НП=Ложь; НД=Ложь", ПараметрыПрописиНаРусском);
	Область.Параметры.Копейки      = Формат(Цел((СуммаНаСчете-Цел(СуммаНаСчете))*100), "ЧЦ=2; ЧН=00");
	
	СведенияОбОтветственном = уп_ПользовательскиеНастройкиСервер.ПолучитьСведенияОбУполномоченномЛице(Документы.уп_РешениеОЕдиновременнойВыплате.ПустаяСсылка(),Организация,ДоговорОПС.Филиал,Пользователи.ТекущийПользователь(),"Решение",Дата);
	Если ЗначениеЗаполнено(СведенияОбОтветственном.Фамилия) Тогда
		Область.Параметры.ДолжностьРуководителя = СведенияОбОтветственном.Должность;
		Область.Параметры.ФИОРуководителя = СведенияОбОтветственном.Фамилия+" "+Лев(СведенияОбОтветственном.Имя,1)+"."+" "+Лев(СведенияОбОтветственном.Отчество,1)+".";
	Иначе
		Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(Организация, Дата);
		Область.Параметры.ФИОРуководителя = Руководители.РуководительПредставление;
		Область.Параметры.ДолжностьРуководителя = Руководители.РуководительДолжность;
	КонецЕсли;	
	
	ТабДок.Вывести(Область); 
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	//ТабДок.Показать();
	//#Вставка
	// +ХМНПФ 14.12.2015 ЛыткинАМ // ПечатьРешенияОВыплате() // №84
	Если ХМ_ПечататьРасчет Тогда ХМ_ФункцииОтчетов.ПечатьРешения_ДобавитьРасчет(ЭтотОбъект,ТабДок) КонецЕсли;
	ТабДок.АвтоМасштаб = Истина;
	// -ХМНПФ 14.12.2015 ЛыткинАМ // ПечатьРешенияОВыплате() // №84
	//#КонецВставки
    Возврат ТабДок;

КонецФункции // ПечатьПриложения1()

// +ХМНПФ 28.02.2017 ШадринАВ // ПечатьРешенияОДопВыплате() // №830
//Функция ПечатьРешенияОДопВыплате()
Функция ПечатьРешенияОДопВыплате(ХМ_ПечататьРасчет = Истина) Экспорт
	//#Вставка
// -ХМНПФ 28.02.2017 ШадринАВ // ПечатьРешенияОДопВыплате() // №830
	//#КонецВставки

	ТабДок = Новый ТабличныйДокумент;
	Если Дата < Дата("20150101") Тогда
		Макет = Документы.уп_РешениеОЕдиновременнойВыплате.ПолучитьМакет("РешениеОДопВыплате");
	Иначе
		Макет = Документы.уп_РешениеОЕдиновременнойВыплате.ПолучитьМакет("ПФ_MXL_РешениеОДопВыплате2015");
	КонецЕсли;
	
	// Заголовок

	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация, Дата);
	ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");

	
	Область = Макет.ПолучитьОбласть("Решение");
	Область.Параметры.Число = Формат(Дата, "ДФ=дд");
	Область.Параметры.Месяц = Сред(Формат(Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(Дата, "ДЛФ=дд")))-10);
	Область.Параметры.Год = Формат(Дата, "ДФ=гггг");
	Область.Параметры.НаименованиеФонда = ПредставлениеОрганизации;
	Область.Параметры.НомерРешения = Номер;
	
	ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", ДоговорОПС.Участник.уп_ФизЛицо));
	Фамилия = ФИОФизЛица.Фамилия;
	Имя = ФИОФизЛица.Имя;                
	Отчество = ФИОФизЛица.Отчество;
	//Область.Параметры.ФИОНомерСчета = Фамилия+" "+Имя+" "+Отчество+", "+уп_ОПС.ПреобразоватьНомерПФР(ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР);
	Область.Параметры.ФИО = Фамилия+" "+Имя+" "+Отчество+", ";
	Область.Параметры.НомерСчета = ДоговорОПС.НомерЛицевогоСчета;
	//Область.Параметры.ДатаРегистрации = ДокументОснование.ДатаРегистрации;
	//Область.Параметры.НомерЗаявления = СокрЛП(ДокументОснование.Номер); 
	
	ВалютаПечати = Константы.ВалютаРегламентированногоУчета.Получить();
	ПараметрыПрописиНаРусском = ВалютаПечати.ПараметрыПрописи;
	ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "1", "0");
	ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "2", "0");
	ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "3", "0");
	Область.Параметры.Сумма=СуммаНаСчете; //ММВ Добавлена сумма числом (рядом с сумой прописью и отцентрировали)
	Область.Параметры.РублиПрописью = ЧислоПрописью(Цел(СуммаНаСчете), "L=ru_RU; НП=Ложь; НД=Ложь", ПараметрыПрописиНаРусском);
	Область.Параметры.Копейки      = Формат(Цел((СуммаНаСчете-Цел(СуммаНаСчете))*100), "ЧЦ=2; ЧН=00");
	
	СведенияОбОтветственном = уп_ПользовательскиеНастройкиСервер.ПолучитьСведенияОбУполномоченномЛице(Документы.уп_РешениеОЕдиновременнойВыплате.ПустаяСсылка(),Организация,ДоговорОПС.Филиал,Пользователи.ТекущийПользователь(),"Решение",Дата);
	Если ЗначениеЗаполнено(СведенияОбОтветственном.Фамилия) Тогда
		//#Удаление
		//Область.Параметры.ДолжностьРуководителя = СведенияОбОтветственном.Должность;
		//#КонецУдаления
		//#Вставка
		// +ХМНПФ 17.08.2017 ШадринАВ // ПечатьРешенияОДопВыплате() // №1131
		//Область.Параметры.ДолжностьРуководителя = СведенияОбОтветственном.Должность;
		// -ХМНПФ 17.08.2017 ШадринАВ // ПечатьРешенияОДопВыплате() // №1131
		//#КонецВставки
		Область.Параметры.ФИОРуководителя = СведенияОбОтветственном.Фамилия+" "+Лев(СведенияОбОтветственном.Имя,1)+". "+Лев(СведенияОбОтветственном.Отчество,1)+".";
	Иначе
		Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(Организация, Дата);
		Область.Параметры.ФИОРуководителя = Руководители.РуководительПредставление;
		Область.Параметры.ДолжностьРуководителя = Руководители.РуководительДолжность;
	КонецЕсли;	
	
	//++https://redmine.npf.com/issues/4544
	КопияВернаФайл = Неопределено;
	Если НЕ ДополнительныеСвойства.Свойство("КопияВерна",КопияВернаФайл) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОрганизацииПрисоединенныеФайлы.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ОрганизацииПрисоединенныеФайлы КАК ОрганизацииПрисоединенныеФайлы
			|ГДЕ
			|	ОрганизацииПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
			|	И ОрганизацииПрисоединенныеФайлы.Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("ВладелецФайла", Организация);
		Запрос.УстановитьПараметр("Наименование", "ЕДВДОП_КопияВерна");
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			КопияВернаФайл = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(КопияВернаФайл) Тогда
        Область.Рисунки.D1.Картинка = Новый Картинка(
			РаботаСФайлами.ДвоичныеДанныеФайла(КопияВернаФайл));
	КонецЕсли;
	//--https://redmine.npf.com/issues/4544
	
	ТабДок.Вывести(Область); 
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	//ТабДок.Показать();
	//#Вставка
	// +ХМНПФ 14.12.2015 ЛыткинАМ // ПечатьРешенияОДопВыплате() // №84
	//Если ХМ_ПечататьРасчет Тогда ХМ_ФункцииОтчетов.ПечатьРешения_ДобавитьРасчет(ЭтотОбъект,ТабДок) КонецЕсли;
	// -ХМНПФ 14.12.2015 ЛыткинАМ // ПечатьРешенияОДопВыплате() // №84
	//#КонецВставки
    Возврат ТабДок;

КонецФункции // ПечатьПриложения2()

// +ХМНПФ 28.02.2017 ШадринАВ // ПечатьРешенияОДопВыплатеСервер() // №830
//Функция ПечатьРешенияОДопВыплатеСервер(ТабДок) Экспорт
Функция ПечатьРешенияОДопВыплатеСервер(ТабДок, ХМ_ПечататьРасчет = Истина) Экспорт
	//#Вставка
// -ХМНПФ 28.02.2017 ШадринАВ // ПечатьРешенияОДопВыплатеСервер() // №830
	//#КонецВставки

	Если ТабДок=Неопределено Тогда
		ТабДок = Новый ТабличныйДокумент;
	Иначе
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	Если Дата < Дата("20150101") Тогда
		Макет = Документы.уп_РешениеОЕдиновременнойВыплате.ПолучитьМакет("РешениеОДопВыплате");
	Иначе
		Макет = Документы.уп_РешениеОЕдиновременнойВыплате.ПолучитьМакет("РешениеОДопВыплате2015");
	КонецЕсли;
	
	// Заголовок

	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация, Дата);
	ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");

	
	Область = Макет.ПолучитьОбласть("Решение");
	Область.Параметры.Число = Формат(Дата, "ДФ=дд");
	Область.Параметры.Месяц = Сред(Формат(Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(Дата, "ДЛФ=дд")))-10);
	Область.Параметры.Год = Формат(Дата, "ДФ=гггг");
	Область.Параметры.НаименованиеФонда = ПредставлениеОрганизации;
	Область.Параметры.НомерРешения = Номер;
	
	ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", ДоговорОПС.Участник.уп_ФизЛицо));
	Фамилия = ФИОФизЛица.Фамилия;
	Имя = ФИОФизЛица.Имя;                
	Отчество = ФИОФизЛица.Отчество;
	//Область.Параметры.ФИОНомерСчета = Фамилия+" "+Имя+" "+Отчество+", "+уп_ОПС.ПреобразоватьНомерПФР(ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР);
	Область.Параметры.ФИО = Фамилия+" "+Имя+" "+Отчество+", ";
	Область.Параметры.НомерСчета = ДоговорОПС.НомерЛицевогоСчета;
	//Область.Параметры.ДатаРегистрации = ДокументОснование.ДатаРегистрации;
	//Область.Параметры.НомерЗаявления = СокрЛП(ДокументОснование.Номер); 
	
	ВалютаПечати = Константы.ВалютаРегламентированногоУчета.Получить();
	ПараметрыПрописиНаРусском = ВалютаПечати.ПараметрыПрописи;
	ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "1", "0");
	ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "2", "0");
	ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "3", "0");
	Область.Параметры.Сумма=СуммаНаСчете; //ММВ Добавлена сумма числом (рядом с сумой прописью и отцентрировали)
	Область.Параметры.РублиПрописью = ЧислоПрописью(Цел(СуммаНаСчете), "L=ru_RU; НП=Ложь; НД=Ложь", ПараметрыПрописиНаРусском);
	Область.Параметры.Копейки      = Формат(Цел((СуммаНаСчете-Цел(СуммаНаСчете))*100), "ЧЦ=2; ЧН=00");
	
	СведенияОбОтветственном = уп_ПользовательскиеНастройкиСервер.ПолучитьСведенияОбУполномоченномЛице(Документы.уп_РешениеОЕдиновременнойВыплате.ПустаяСсылка(),Организация,ДоговорОПС.Филиал,Пользователи.ТекущийПользователь(),"Решение",Дата);
	Если ЗначениеЗаполнено(СведенияОбОтветственном.Фамилия) Тогда
		//#Удаление
		//Область.Параметры.ДолжностьРуководителя = СведенияОбОтветственном.Должность;
		//#КонецУдаления
		//#Вставка
		// +ХМНПФ 17.08.2017 ШадринАВ // ПечатьРешенияОДопВыплатеСервер() // №1131
		//Область.Параметры.ДолжностьРуководителя = СведенияОбОтветственном.Должность;
		// -ХМНПФ 17.08.2017 ШадринАВ // ПечатьРешенияОДопВыплатеСервер() // №1131
		//#КонецВставки
		Область.Параметры.ФИОРуководителя = СведенияОбОтветственном.Фамилия+" "+Лев(СведенияОбОтветственном.Имя,1)+". "+Лев(СведенияОбОтветственном.Отчество,1)+".";
	Иначе
		Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(Организация, Дата);
		Область.Параметры.ФИОРуководителя = Руководители.РуководительПредставление;
		Область.Параметры.ДолжностьРуководителя = Руководители.РуководительДолжность;
	КонецЕсли;	
	
	ТабДок.Вывести(Область); 
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	//ТабДок.Показать();
	//#Вставка
 	// +ХМНПФ 14.12.2015 ЛыткинАМ // ПечатьРешенияОДопВыплате() // №84
	Если ХМ_ПечататьРасчет Тогда ХМ_ФункцииОтчетов.ПечатьРешения_ДобавитьРасчет(ЭтотОбъект,ТабДок) КонецЕсли;
	ТабДок.АвтоМасштаб = Истина;
	// -ХМНПФ 14.12.2015 ЛыткинАМ // ПечатьРешенияОДопВыплате() // №84
	//#КонецВставки
   	Возврат ТабДок;

КонецФункции // ПечатьПриложения2()

&ИзменениеИКонтроль("ПроверитьДатыПредыдущихРешений")
Процедура РасшОбщ_ПроверитьДатыПредыдущихРешений(Отказ = ЛОЖЬ)  //киселев
  
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_РешениеОЕдиновременнойВыплате.ДокументОснование.Дата КАК ДокументОснованиеДата,
		|	уп_РешениеОЕдиновременнойВыплате.Ссылка
		|ИЗ
		|	Документ.уп_РешениеОЕдиновременнойВыплате КАК уп_РешениеОЕдиновременнойВыплате
		|ГДЕ
		|	уп_РешениеОЕдиновременнойВыплате.Ссылка <> &Ссылка
		|	И уп_РешениеОЕдиновременнойВыплате.ДоговорОПС = &ДоговорОПС
		|	И уп_РешениеОЕдиновременнойВыплате.ДополнительнаяВыплата = ЛОЖЬ
		|	И уп_РешениеОЕдиновременнойВыплате.ДоначислениеПоПереданномуВзносуИзПФР = ЛОЖЬ
		|	И уп_РешениеОЕдиновременнойВыплате.ДокументОснование <> &ДокументОснование
		|	И уп_РешениеОЕдиновременнойВыплате.Дата < &Дата
		|	И уп_РешениеОЕдиновременнойВыплате.ДокументОснование.Дата >= &ДатаНачалаПроверкиПериода
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументОснованиеДата УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаНачалаПроверкиПериода", '20150101');
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
		#Удаление
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументОснованиеДата) Тогда
		#КонецУдаления
		#Вставка
		// +ХМНПФ 07.09.2017 ШадринАВ // ПроверитьДатыПредыдущихРешений() // №1147
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументОснованиеДата) И ВыборкаДетальныеЗаписи.ДокументОснованиеДата >= '20150101' Тогда
		// -ХМНПФ 07.09.2017 ШадринАВ // ПроверитьДатыПредыдущихРешений() // №1147
		#КонецВставки
			ДатаРазрешения = ДобавитьМесяц(ВыборкаДетальныеЗаписи.ДокументОснованиеДата,5*12);
			Если НачалоДня(Дата)<НачалоДня(ДатаРазрешения) Тогда
				//пока нельзя подавать
				Сообщить("По договору "+ДоговорОПС+" заявление на ЕВ было подано "+Формат(ВыборкаДетальныеЗаписи.ДокументОснованиеДата,"ДФ=dd.MM.yyyy")+", "+ВыборкаДетальныеЗаписи.Ссылка+". 
				|Пятилетний срок еще не истек!", СтатусСообщения.ОченьВажное);
				//Отказ = Истина;
			КонецЕсли;	                                                                                                                                      
		КонецЕсли;
	КонецЕсли ;
	
Конецпроцедуры

&ИзменениеИКонтроль("ПроверкаКорректности")
Процедура РасшОбщ_ПроверкаКорректности(Отказ, Заголовок)
	
	//еще надо проверить, чтобы тип суммы и тип резерва были заполнены
	Для каждого стр из РасшифровкаСуммы Цикл
		Если НЕ ЗначениеЗаполнено(стр.ТипСуммы) Тогда
			Отказ = Истина;
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору №"+стр.ДоговорОПС+" в расшифровке не указан тип суммы.",,Заголовок);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(стр.ТипРезерва) Тогда
			Отказ = Истина;
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору №"+стр.ДоговорОПС+" в расшифровке не указан тип резерва.",,Заголовок);
		КонецЕсли;
	КонецЦикла;
	
	ЕстьОстатокОснЧасти = ЛОЖЬ;
	ЕстьОстатокДопЧасти = ЛОЖЬ;
	
	//еще проверка остатков в регистре
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уп_РешениеОЕдиновременнойВыплатеРасшифровкаСуммы.Ссылка.ДоговорОПС КАК ДоговорОПС,
	               |	уп_РешениеОЕдиновременнойВыплатеРасшифровкаСуммы.ТипРезерва КАК ТипРезерва,
	               |	уп_РешениеОЕдиновременнойВыплатеРасшифровкаСуммы.ТипСуммы КАК ТипСуммы,
	               |	уп_РешениеОЕдиновременнойВыплатеРасшифровкаСуммы.Сумма КАК Сумма,
	               |	уп_РешениеОЕдиновременнойВыплатеРасшифровкаСуммы.СуммаКомпенсации КАК СуммаКомпенсации,
	               |	уп_РешениеОЕдиновременнойВыплатеРасшифровкаСуммы.СуммаВосполнения КАК СуммаВосполнения,
	               |	уп_РешениеОЕдиновременнойВыплатеРасшифровкаСуммы.СуммаВозмещения КАК СуммаВозмещения,
	               |	уп_РешениеОЕдиновременнойВыплатеРасшифровкаСуммы.СуммаГарантированная КАК СуммаГарантированная
	               |ПОМЕСТИТЬ ТаблицаДокумента
	               |ИЗ
	               |	Документ.уп_РешениеОЕдиновременнойВыплате.РасшифровкаСуммы КАК уп_РешениеОЕдиновременнойВыплатеРасшифровкаСуммы
	               |ГДЕ
	               |	уп_РешениеОЕдиновременнойВыплатеРасшифровкаСуммы.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДокумента.ДоговорОПС КАК ДоговорОПС,
	               |	ЕСТЬNULL(ТаблицаДокумента.ТипСуммы, уп_РезервыОПСОстатки.ТипСуммы) КАК ТипСуммы,
	               |	ЕСТЬNULL(ТаблицаДокумента.Сумма, 0) КАК Сумма,
	               |	ЕСТЬNULL(уп_РезервыОПСОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	ЕСТЬNULL(ТаблицаДокумента.ТипРезерва, уп_РезервыОПСОстатки.ТипРезерва) КАК ТипРезерва,
	               |	ЕСТЬNULL(ТаблицаДокумента.СуммаГарантированная, 0) КАК СуммаГарантированная
	               |ИЗ
	               |	ТаблицаДокумента КАК ТаблицаДокумента
	               |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_РезервыОПС.Остатки(
	               |				&ДатаДок,
	               |				ДоговорОПС = &ДоговорОПС
	               |					И Организация = &Организация
	               |					И ТипРезерва В (&РезервыЕВ)) КАК уп_РезервыОПСОстатки
	               |		ПО ТаблицаДокумента.ТипСуммы = уп_РезервыОПСОстатки.ТипСуммы
	               |			И ТаблицаДокумента.ТипРезерва = уп_РезервыОПСОстатки.ТипРезерва";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаДок", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	Запрос.УстановитьПараметр("Накопительный", Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	РезервыЕВ = Новый СписокЗначений;
	РезервыЕВ.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	РезервыЕВ.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервЕВ);
	Запрос.УстановитьПараметр("РезервыЕВ", РезервыЕВ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ДатаВступления = Константы.уп_ДатаВступленияВСистемуГарантирования.Получить();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Сумма>Выборка.СуммаОстаток Тогда
			#Удаление
			Отказ = Истина;
			#КонецУдаления
			#Вставка
			// ХМНПФ 10.09.2016 ЛыткинАМ //ПроверкаКорректности
			#КонецВставки
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору №"+Выборка.ДоговорОПС+" по типу суммы "+Выборка.ТипСуммы+" не достаточно средств",,Заголовок);
		Иначе
			Если Выборка.Сумма<Выборка.СуммаОстаток Тогда
				Если Выборка.ТипСуммы = Справочники.уп_ТипыСуммОПС.ВзносыФиз или Выборка.ТипСуммы = Справочники.уп_ТипыСуммОПС.ИДФиз Тогда
					ЕстьОстатокОснЧасти = ИСТИНА;
				Иначе
					ЕстьОстатокДопЧасти = ИСТИНА;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		#Удаление
		Если ЗначениеЗаполнено(ДатаВступления) И Дата>=ДатаВступления И НЕ ДополнительнаяВыплата Тогда
		#КонецУдаления
		#Вставка
		// +ХМНПФ 04.04.2016 ШадринАВ // ПроверкаКорректности() // №299
		Если Ложь Тогда
		// -ХМНПФ 04.04.2016 ШадринАВ // ПроверкаКорректности() // №299
		#КонецВставки
			Если Выборка.Сумма<Выборка.СуммаГарантированная Тогда
				Отказ = Истина;
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору №"+Выборка.ДоговорОПС+" по типу суммы "+Выборка.ТипСуммы+" остаток на счете меньше гарантированной суммы. Необходимо оформить документ ""Перевод средств из резерва ОПС"".",,Заголовок);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	#Вставка
	// +ХМНПФ 04.04.2016 ШадринАВ // ПроверкаКорректности() // №299
	Если ЗначениеЗаполнено(ДатаВступления) И Дата>=ДатаВступления И НЕ ДополнительнаяВыплата Тогда
		ТЗРез = Результат.Выгрузить();
		Если ТЗРез.Итог("Сумма")<ТЗРез.Итог("СуммаГарантированная") Тогда
			//Отказ = Истина;	// -ХМНПФ 28.07.2016 ШадринАВ // ПроверкаКорректности() // №447
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору №"+Выборка.ДоговорОПС+" остаток на счете меньше гарантированной суммы. Необходимо оформить документ ""Перевод средств из резерва ОПС"".",,Заголовок);
		КонецЕсли;
	КонецЕсли;
	// -ХМНПФ 04.04.2016 ШадринАВ // ПроверкаКорректности() // №299
	#КонецВставки
	//проверка отрицательных остатков
	ТабОстатков = ПолучитьОстатки();
	Для каждого стр из ТабОстатков Цикл
		Если стр.Сумма<0 Тогда
			Сообщить("По договору "+ДоговорОПС+" по типу суммы "+стр.типСуммы+" остаток по счету составляет:"+стр.Сумма, СтатусСообщения.Важное);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

// ХМНПФ 19.0217 Кучеров // Новая Функция ХМ_ПечатьWeb()
// для получения печатных форм со стороны Web сервисов
// аналог процедуры печать типового варианта пользовательского интерфейса
Функция ХМ_ПечатьWeb(ИмяМакета) Экспорт
	ТабДокумент = Новый ТабличныйДокумент; // заглушка если передали пустой макет
	Если ИмяМакета = "Решение" и ДополнительнаяВыплата = Ложь и НЕ ДоначислениеПоПереданномуВзносуИзПФР тогда
		ТабДокумент = ПечатьРешенияОВыплате(Ложь);
	ИначеЕсли  ИмяМакета = "Решение" и ДоначислениеПоПереданномуВзносуИзПФР = Истина тогда
		ТабДокумент = ПечатьРешенияОДопВыплате(Ложь);
	ИначеЕсли  ИмяМакета = "Решение" и ДополнительнаяВыплата = Истина тогда
		ТабДокумент = ПечатьРешенияОДопВыплате(Ложь);
	КонецЕсли;
	
	Возврат ТабДокумент;
КонецФункции

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, РежимПроведения, СтрокаТЗ = Неопределено, СтруктураТЧ = Неопределено) Экспорт
	Если НЕ ПРОВЕДЕН Тогда
		#Если Сервер Тогда
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_РезервыОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПрочиеНачисленияОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ДатыОбращенияЗаЕдиновременнойВыплатой);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_СостоянияДоговораОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПричиныЗакрытияДоговоровОПС);
		#КонецЕсли
		Возврат;	
	КонецЕсли;
	Для Каждого стр из РасшифровкаСуммы Цикл
		
		Движение = Движения.уп_РезервыОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = стр.ХМ_ДатаВыплаты;
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.Организация = Организация;
		Движение.ТипСуммы = стр.ТипСуммы;
		Движение.ТипРезерва = стр.ТипРезерва;
		Движение.Сумма = стр.Сумма;
		Движение.Движение = Перечисления.уп_ВидыДвижений.ЕдиновременнаяВыплатаОПС;
		
		Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = стр.ХМ_ДатаВыплаты;
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.Организация = Организация;
		Движение.ТипСуммы = стр.ТипСуммы;
		Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС;
		Движение.Участник = Участник;
		Движение.Сумма = стр.Сумма;
		Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
		Движение.СуммаВосполнения = стр.СуммаВосполнения;
		Движение.СуммаВозмещения = стр.СуммаВозмещения; 
//ЛыткинАМ https://redmine.npf.com/issues/4739
//		Движение.Решение = Ссылка; 
	КонецЦикла;
	
	Если НЕ ДополнительнаяВыплата Тогда
		Движение = Движения.уп_ДатыОбращенияЗаЕдиновременнойВыплатой.Добавить();
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.Период = Дата;
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			ДатаОбращения = ДокументОснование.Дата;
		Иначе
			ДатаОбращения = Дата;
		КонецЕсли;	
		Движение.ДатаОбращения = ДатаОбращения;
		Движение.ВключатьДопВзносы = НЕ НеУчитыватьДопВзносы;
		
		Движение = Движения.уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС.Добавить();
		Движение.Период = Дата;
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.Состояние = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.ЕдиновременнаяВыплата;
		
		Если НЕ НеУчитыватьДопВзносы Тогда
			//здесь еще надо проверить, есть ли вообще эта дополнительная часть
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.Состояние
			|ИЗ
			|	РегистрСведений.уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС.СрезПоследних(&ТекДата, ДоговорОПС = &ДоговорОПС) КАК уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних";
			
			Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
			Запрос.УстановитьПараметр("ТекДата", Дата);
			
			Результат = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				Если ВыборкаДетальныеЗаписи.Состояние<>Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.СрочнаяВыплата Тогда
					Движение = Движения.уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС.Добавить();
					Движение.Период = Дата;
					Движение.ДоговорОПС = ДоговорОПС;
					Движение.Состояние = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.ЕдиновременнаяВыплата;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе  
	КонецЕсли;	
		
	//состояние
	Если ДополнительнаяВыплата Тогда
	Иначе
		//здесь лучше выплатной период проставить
		Движение = Движения.уп_СостоянияДоговораОПС.Добавить();
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.Период = Дата;
		Движение.Состояние = Перечисления.уп_СостоянияДоговоровОПС.ВыплатнойПериод;
		
		//причины закрытия
		Движение = Движения.уп_ПричиныЗакрытияДоговоровОПС.Добавить();
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.Период = Дата;
		Движение.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ЕдиновременнаяВыплата;
	КонецЕсли;
		
#Если Сервер Тогда
	ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_РезервыОПС);
	ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПрочиеНачисленияОПС);
	ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ДатыОбращенияЗаЕдиновременнойВыплатой);
	ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС);
	ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС);
	ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_СостоянияДоговораОПС);
	ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПричиныЗакрытияДоговоровОПС);
#КонецЕсли
КонецПроцедуры

&После("ПриЗаписи")
Процедура ХМПриЗаписи(Отказ)
//ЛыткинАМ //[GLPI #0007905] Новая заявка 1 С //Открепить решение из основания при пометке на удаление
	Если Отказ = Ложь Тогда
		Если ПометкаУдаления = Истина И ЗначениеЗаполнено(ДокументОснование) Тогда
			Если НЕ Ссылка.ДополнительнаяВыплата И НЕ ДоначислениеПоПереданномуВзносуИзПФР Тогда
				уп_ОбработчикУдаления.ХМ_ОткрепитьРешениеВДокументОснование(ДокументОснование, Ссылка);
				//ДокОснОбъект = ДокументОснование.ПолучитьОбъект();
				//ДокОснОбъект.ПринятоеРешение = Ссылка;
				//ДокОснОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Вставить содержимое метода.
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура ХМОбработкаПроведения(Отказ, РежимПроведения)
	ХМ_ПодпискиНаСобытия.ХМ_ОбработкаПроведенияРешений(ЭтотОбъект, Отказ, РежимПроведения);
	ХМ_ПодпискиНаСобытия_Сервер.ХМ_ОбработкаПоСозданиюОповещений(ЭтотОбъект, Отказ, РежимПроведения);
КонецПроцедуры 

&После("ПриУстановкеНовогоНомера")
Процедура ХМ_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	ХМ_ПодпискиНаСобытия.ХМ_НомераРешенийПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);	
КонецПроцедуры
